# GetStringValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..GetStringValue Method
ScheduleFilter Class See Also
---
Gets the filter value for a filter using a string value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string GetStringValue()
```

Visual Basic
---
```text
Public Function GetStringValue As String
```

Visual C++
---
```text
public:
String^ GetStringValue()
```

# ### Return Value
The filter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The filter value is not a string. |

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace